package com.ohgiraffers.section06.ternary;

import javax.swing.*;

public class pr2 {

    public static void main(String[] args) {

        /* 문제.
        * 입력하는 알파벳이 무엇인지 맞추는 게임을 만드려고 합니다. (대/소문자도 정확하게)
        * 대문자 A를 1, Z를 26, 소문자 a를 27, z를 52라는 값을 가진다.
        * 만약 문자 'e' 에 대해 맞추려고 할 때, 아래의 조건에 맞는 값이 나오도록 코딩하시오.
        * (새로운 문자를 넣는 것이 아닌, 아래 조건에만 맞도록 만드시면 됩니다.)
        *
        * 1. 'e'가 A보다 크고 M보다 같거나 작으면 "근처!", 아니면 "땡"를 호출하세요.
        * 2. 'e'가 M보다 크고 Z보다 같거나 작으면 "근처!", 아니면 "땡"를 호출하세요.
        * 3. 'e'가 a보다 크고 m보다 같거나 작으면 "근처!", 아니면 "땡"를 호출하세요.
        * 4. 'e'가 m보다 크고 z보다 같거나 작으면 "근처!", 아니면 "땡"를 호출하세요.
        *         *
        *  AND 연산과 OR 연산의 특징
        *   논리식 && 논리식 : 앞의 결과가 false면 뒤를 실행조차 안한다.
        *   논리식 || 논리식 : 앞의 결과가 true면 뒤를 실행조차 안한다.
        *
        * */

        char afb = 'e';
        String o = "근처";
        String x = "땡";

        System.out.println("");



    }

}
